package com.oopproject.wineryapplication.managment.purchases;

import com.oopproject.wineryapplication.access.entities.entity.Entity;

/**
 * Интерфейс, представляващ покупка на обект, който наследява {@link Entity}.
 * Той дефинира операцията за извършване на покупка и връщане на закупения обект.
 *
 * @param <T> Типът на entity-то, което ще бъде закупено. Този тип трябва да наследява
 *            {@link Entity}, за да се гарантира съвместимост с инфраструктурата на системата.
 */
public interface Purchase<T extends Entity> {
    /**
     * Извършва операция по покупка и връща закупения обект.
     * <p>
     * Методът {@code buy} е основната операция на интерфейса {@link Purchase}, която
     * е предназначена да бъде имплементирана в конкретни класове, обработващи различни типове покупки.
     * Тя връща инстанция от тип {@code T}, която наследява {@link Entity}.
     * </p>
     *
     * @return Закупеният обект от тип {@code T}, който отговаря на имплементацията на конкретния вид покупка.
     */
    T buy();
}
